# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2 - 320
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4 - 160
   [-1, 1, MIRB, [256, nn.ReLU()]],
   [-1, 1, C3_CBAM, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 4-P3/8 - 80
   [-1, 1, MIRB, [512, nn.ReLU()]],
   [-1, 1, C3_CBAM, [512]],
   [-1, 1, PISPPF, [256]],  # 7
  ]
# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #9 - 160
   [[-1, 3], 1, Concat, [1]],  # cat backbone P2

   [-1, 1, MIRB, [512, nn.ReLU()]], # 10 -> out 256

   [-1, 1, C3_CBAM, [256]],
   [-1, 1, Conv, [512, 3, 1]],
   [[-1, 6], 1, Concat, [1]],

   [-1, 1, MIRB, [1024, nn.ReLU()]], #14 -> out 1024

   [-1, 1, C3_CBAM, [512]], #15 -> out 512

   [[10, 14, 15], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
